; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	spectrograph3 - mode
	thermograph4 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	infrared5 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star5 - direction
	Star8 - direction
	Star7 - direction
	GroundStation6 - direction
	GroundStation1 - direction
	Star4 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared5)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 spectrograph3)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
)
(:goal (and
	(have_image Phenomenon9 spectrograph1)
	(have_image Phenomenon9 spectrograph2)
	(have_image Planet10 infrared5)
	(have_image Planet10 spectrograph3)
	(have_image Phenomenon11 thermograph4)
	(have_image Phenomenon11 spectrograph3)
	(have_image Star12 spectrograph2)
	(have_image Star12 spectrograph0)
	(have_image Star13 spectrograph3)
	(have_image Star14 spectrograph0)
	(have_image Planet15 spectrograph0)
	(have_image Planet15 spectrograph2)
))

)

; plan
1. (turn_to satellite1 star4 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star4)
   goals met: 0 of 12
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite1 phenomenon9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 12
5. (take_image satellite1 phenomenon9 instrument1 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 1 of 12
6. (turn_to satellite1 phenomenon11 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon11)
   goals met: 1 of 12
7. (take_image satellite1 phenomenon11 instrument1 thermograph4)
   added: (have_image phenomenon11 thermograph4)
   goals met: 2 of 12
8. (take_image satellite1 phenomenon11 instrument1 spectrograph3)
   added: (have_image phenomenon11 spectrograph3)
   goals met: 3 of 12
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 12
10. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 3 of 12
11. (turn_to satellite0 phenomenon9 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 12
12. (take_image satellite0 phenomenon9 instrument0 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 4 of 12
13. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 4 of 12
14. (take_image satellite0 planet10 instrument0 infrared5)
   added: (have_image planet10 infrared5)
   goals met: 5 of 12
15. (take_image satellite0 planet10 instrument0 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 6 of 12
16. (turn_to satellite0 planet15 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet15)
   goals met: 6 of 12
17. (take_image satellite0 planet15 instrument0 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 7 of 12
18. (turn_to satellite0 star12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star12)
   goals met: 7 of 12
19. (take_image satellite0 star12 instrument0 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 8 of 12
20. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 8 of 12
21. (take_image satellite0 star13 instrument0 spectrograph3)
   added: (have_image star13 spectrograph3)
   goals met: 9 of 12
22. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 9 of 12
23. (take_image satellite0 star14 instrument0 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 10 of 12
24. (turn_to satellite1 planet15 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet15)
   goals met: 10 of 12
25. (take_image satellite1 planet15 instrument1 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 11 of 12
26. (turn_to satellite1 star12 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star12)
   goals met: 11 of 12
27. (take_image satellite1 star12 instrument1 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 12 of 12
